# **Missing Data**

In [47]:
import numpy as np
import pandas as pd

In [54]:
df = pd.DataFrame({"A":[1, 2, np.nan, 3], "B":[7, np.nan, 4, 10], "C":[np.nan, np.nan, 5, 90], "D":[9, 3, 0, -9]})

In [55]:
df

     A     B     C  D
0  1.0   7.0   NaN  9
1  2.0   NaN   NaN  3
2  NaN   4.0   5.0  0
3  3.0  10.0  90.0 -9

In [56]:
df.dropna()

     A     B     C  D
3  3.0  10.0  90.0 -9

In [58]:
df.dropna(axis = 1)

   D
0  9
1  3
2  0
3 -9

In [59]:
df.dropna(thresh = 2)

     A     B     C  D
0  1.0   7.0   NaN  9
1  2.0   NaN   NaN  3
2  NaN   4.0   5.0  0
3  3.0  10.0  90.0 -9

In [61]:
df.dropna(thresh = 3)

     A     B     C  D
0  1.0   7.0   NaN  9
2  NaN   4.0   5.0  0
3  3.0  10.0  90.0 -9

In [62]:
df.fillna(value = "NULL")

      A     B     C  D
0     1     7  NULL  9
1     2  NULL  NULL  3
2  NULL     4     5  0
3     3    10    90 -9

In [ ]:
df.